<p class="mt-3">
  <span lang="th" xml:lang="th"> ชื่อ</span>
  <span lang="th" xml:lang="th">โรงเรียนบ้านบางเหรียง   ที่ตั้ง  หมู่ที่ ๙  บ้านวังน้ำเย็น ถนน เขาพนม- ทุ่งใหญ่ ตำบลพรุเตียว  อำเภอ เขาพนม จังหวัดกระบี่ รหัสไปรษณีย์ ๘๑๑๔๐  </span>
  <span lang="th" xml:lang="th">สังกัดเขตพื้นที่การศึกษาประถมศึกษากระบี่  </span>
  <span lang="th" xml:lang="th">โทรศัพท์ ๐๗๕-๖๑๓๗๑๑ </span>
       e-mail<span lang="th" xml:lang="th"> </span>
  :<span lang="th" xml:lang="th"> </span>
  bangringsch@ hotmail.com  <span lang="th" xml:lang="th">เปิดสอนตั้งแต่ระดับ</span>
  <span lang="th" xml:lang="th">ปฐมวัย (อนุบาล๑ -๒) ถึงระดับชั้นมัธยมศึกษาปีที่ ๓</span>
     <span lang="th" xml:lang="th">เนื้อที่  ๑๐๕ ไร่</span>
  <span lang="th" xml:lang="th">  เขตพื้นที่บริการ</span>
  <span lang="th" xml:lang="th"> ๔  หมู่บ้าน ได้แก่หมู่ที่ ๙  (บ้านวังน้ำเย็น)หมู่ที่ ๓  (บ้านบางเหรียง)  หมู่ที่ ๔ (บ้านลานควาย)  หมู่ที่ ๗  (บ้านทุ่งปรือ)</span>
</p>

<p><strong><span lang="th" xml:lang="th">ประวัติโรงเรียนโดยย่อ</span></strong></p>
<p><strong><em><span lang="th" xml:lang="th">โรงเรียนบ้านบางเหรียง</span></em></strong><span lang="th" xml:lang="th"> เป็นโรงเรียนในสังกัดเขตพื้นที่การศึกษาประถมศึกษากระบี่ สำนักงานคณะกรรมการการศึกษาขั้นพื้นฐาน กระทรวงศึกษาธิการ เป็นโรงเรียนขยายโอกาส    เปิดทำการสอน ตั้งแต่ ชั้นอนุบาล ๑ ถึงชั้นมัธยมศึกษาปีที่ ๓ ตั้งอยู่ที่ หมู่ที่ ๙ ตำบลพรุเตียว อำเภอ เขาพนม จังหวัดกระบี่    กิโลเมตรที่ ๑๓</span>  <span lang="th" xml:lang="th">ทางหลวงหมายเลข ๔๑๕๖ สายเขาพนม-ทุ่งใหญ่ มีชุมชน ในเขตบริการจำนวน ๔ หมู่บ้าน คือหมู่ที่ ๓ หมู่ที่ ๔ หมู่ที่ ๗ และหมู่ที่ ๙  ของตำบลพรุเตียว</span></p>
<p><strong><em><span lang="th" xml:lang="th">โรงเรียนบ้านบางเหรียง</span></em></strong><strong><span lang="th" xml:lang="th"> </span></strong><span lang="th" xml:lang="th">จัดตั้งขึ้นเมื่อ ปีการศึกษา ๒๕๑๕  โดยนายรื่น  คล้ายบุตร ผู้ใหญ่บ้าน หมู่ที่ ๑๓ ตำบลเขาพนม อำเภอเขาพนม ในขณะนั้น (ปัจจุบันคือหมู่ที่ ๙) ได้ร่วมกับราษฎรในหมู่บ้านร่วมบุกเบิกสถานที่และช่วยกันสละทรัพย์สินและแรงงาน สร้างอาคารเรียนชั่วคราว ขึ้น ๑ หลัง ในที่ดินซึ่งได้รับบริจาคจาก นางพัว  จันทร์ดี จำนวน ๑๐๕ ไร่</span></p>
<p><strong><em><span lang="th" xml:lang="th">โรงเรียนบ้านบางเหรียง</span></em></strong><span lang="th" xml:lang="th"> เปิดทำการครั้งแรกเมื่อ ๑๗ พฤษภาคม ๒๕๑๕ เริ่มแรกเปิดสอนชั้นประถมศึกษาปีที่ ๑  จำนวน ๑ ห้องเรียน นักเรียน ๓๙ คน มี นายแคล้ว สุขกาย ครูโรงเรียนบ้านห้วยสาร มาช่วยราชการเป็นครูผู้สอนคนแรก และต่อมาได้รับแต่งตั้งให้ดำรงตำแหน่งครูใหญ่คนแรกของโรงเรียน โรงเรียนได้พัฒนาและเติบโตมาเรื่อยๆ จนถึง ปีการศึกษา ๒๕๓๒ ได้เปิดสอนระดับก่อนประถมศึกษา เพิ่มขึ้นอีก ๑ ระดับ และในปีการศึกษา ๒๕๓๕ ได้รับการจัดตั้งจากสำนักงานการประถมศึกษาจังหวัดกระบี่ ให้เป็นโรงเรียนขยายโอกาส  เปิดทำการเรียนการสอนระดับมัธยมศึกษาตอนต้น อีก ๑ ระดับ</span></p>
<p><strong><em><span lang="th" xml:lang="th">ปัจจุบัน</span></em></strong><strong><span lang="th" xml:lang="th"> </span></strong><span lang="th" xml:lang="th">โรงเรียนบ้านบางเหรียง มีข้าราชการครู ๑๖ คน ครูอัตราจ้าง ๓ คน นักเรียน ๒๕๔ คน พนักงานบริการ ๑ คน พนักงานธุรการ ๑ คน มีอาคารเรียนอาคารประกอบ คือ อาคารเรียน แบบ ป.๑ ก ขนาด ๒ ห้องเรียน ๑</span> <span lang="th" xml:lang="th">หลัง แบบ ป.๑ ก ขนาด ๓ ห้องเรียน ๑</span> <span lang="th" xml:lang="th">หลัง (ถูกไฟไหม้ได้รับความเสียหายทั้งหลัง) แบบ ป.๑ก ขนาด ๔ ห้องเรียน ๑ หลัง ทุกหลังอยู่ในสภาพชำรุด อาคารเรียน แบบ สปช ๑๐๕</span>/<span lang="th" xml:lang="th">๒๙ ขนาด ๘ ห้องเรียน ๑หลัง</span> <span lang="th" xml:lang="th">ส้วม ๑๒ ที่นั่ง สภาพชำรุด อาคารอเนกประสงค์แบบองค์การบริหารส่วนจังหวัด </span> <span lang="th" xml:lang="th">๑ หลัง สภาพชำรุด และแบบ อบต. ๑ หลัง</span></p>