
                      <p class="mt-3"><strong>โรงเรียนน่าอยู่มีแหล่งเรียนรู้ครบครัน</strong></p>
                      <p>๑. จัดสภาพแวดล้อมทั้งภายในและภายนอก ให้เอื้อต่อการเรียนรู้</p>
                      <p>๒. สำรวจ และจัดทำทะเบียน แหล่งเรียนรู้ในท้องถิ่น</p>
                      <p><strong>ครู</strong><strong>/</strong><strong>นักเรียนมีคุณภาพ คุณธรรม</strong></p>
                      <p>        ๓. จัดกิจกรรมการเรียนการสอน และกระบวนการเรียนรู้ ที่หลากหลายเน้นการปฏิบัติจริง</p>
                      <p>        ๔. จัดให้มีการเรียนรู้ที่หลากหลาย โดยการมีส่วนร่วมของชุมชนในท้องถิ่น</p>
                      <p>        ๕. ดำเนินการให้ครูมีการแสวงหาความรู้ และพัฒนาตนเองให้ทันโลกทันเหตุการณ์ มีโลกทัศน์ และวิสัยทัศน์ที่กว้างไกล</p>
                      <p>        ๖. ควบคุมดูแลให้ครูและบุคลากรปฏิบัติตนมีคุณธรรมจริยธรรม ทั้งเป็นแบบอย่างที่ดี</p>
                      <p>        ๗. จัดให้มีระบบการประกันคุณภาพการศึกษาภายในโรงเรียน</p>
                      <p><strong>ชุมชนร่วมกันจัดการ</strong></p>
                      <p>        ๘. ส่งเสริมสนับสนุนให้ชุมชนมีส่วนร่วมในการจัดการศึกษา</p>
                      <p>        ๙. ส่งเสริมสนับสนุนให้ใช้แหล่งเรียนรู้และภูมิปัญญาท้องถิ่น เป็นสื่อการเรียนรู้</p>
                      <p>        ๑๐. สำรวจและจัดทำทะเบียนภูมิปัญญาท้องถิ่น พร้อมทั้ง ส่งเสริมสนับสนุนให้ภูมิปัญญาท้องถิ่นเข้ามามีส่วนร่วมในการจัดกิจกรรมการเรียนรู้</p>
                      <p><strong>สามประสานงานติดตามดูแลช่วยเหลือนักเรียน และแนะแนว</strong></p>
                      <p>        ๑๑. จัดให้มีกิจกรรมดูแลช่วยเหลือนักเรียน/โรงเรียนเพื่อนเด็ก</p>
                      <p>        ๑๒. จัดให้มีกิจกรรมแนะแนว ชีวิต แนะแนวเรียนต่อ แนะแนวอาชีพ</p>
                      <p><strong>นักเรียน มีผลงานเป็นที่ยอมรับมีความรู้คู่คุณธรรม</strong> <strong>น้อมนำปรัชญาของเศรษฐกิจพอเพียง</strong></p>
                      <p>        ๑๓. จัดกิจกรรมการเรียนรู้ให้นักเรียนเห็นคุณค่าของตนเอง มีวินัยในตนเอง ปฏิบัติตนตามหลักธรรมของศาสนาที่ตนนับถือ มีคุณธรรม จริยธรรมและค่านิยมอันพึงประสงค์ น้อมนำปรัชญาของเศรษฐกิจพอเพียง  </p>
                      <p> </p>
                      <p><strong>มีชื่อเสียงวิชาหลัก</strong></p>
                      <p>       ๑๔. จัดกิจกรรมส่งเสริมนักเรียนที่มีความสามารถพิเศษ ด้านวิทยาศาสตร์ คณิตศาสตร์ ภาษา และศิลปะ เข้าประกวด แข่งขัน ในระดับต่างๆ ตามศักยภาพ</p>
                      <p><strong>เป็นนักค้นคว้า</strong></p>
                      <p>        ๑๕. จัดกิจกรรมการเรียนรู้ให้นักเรียนเกิดทักษะและกระบวนการ โดยเฉพาะทางคณิตศาสตร์ วิทยาศาสตร์ และทักษะกระบวนการคิดวิเคราะห์  ค้นคว้าหาความรู้ทางอินเทอร์เนต รู้จักใช้เทคโนโลยีอย่างสร้างสรรค์</p>
                      <p><strong>รู้ทำมาหากิน /ใช้ภูมิปัญญาท้องถิ่นสร้างงาน</strong><strong>/</strong><strong>อยู่กินตามวิถีไทย/ใส่ใจสุขภาพ</strong></p>
                      <p>        ๑๖. จัดกิจกรรมการเรียนรู้ให้นักเรียนมีทัศนคติที่ดีต่อการเป็นผู้ผลิต และเกิดทักษะในการผลิตและประสิทธิภาพในการบริโภค มีค่านิยมที่เป็นผู้ผลิตมากกว่าผู้บริโภค เน้นภูมิปัญญาท้องถิ่น และเศรษฐกิจพอเพียง</p>
                      <p>       ๑๗. จัดกิจกรรมส่งเสริมสุขภาพและสุขนิสัยที่ดี</p>
                      <p><strong>สืบสานวัฒนธรรม</strong></p>
                      <p>        ๑๘. จัดกิจกรรมการเรียนรู้ให้นักเรียนมีจิตสำนึกในการอนุรักษ์ภาษาไทย ศิลปวัฒนธรรมประเพณีไทย กีฬาไทย ภูมิปัญญาไทย และทรัพยากรธรรมชาติ</p>
                      <p><strong>ร่วมรังสรรค์ท้องถิ่น</strong></p>
                      <p>        ๑๙. จัดกิจกรรมการเรียนรู้ให้นักเรียนรักประเทศชาติ รักท้องถิ่น รักถิ่นฐาน มุ่งทำประโยชน์และสร้างสรรค์สิ่งที่ดีงามให้สังคม เห็นประโยชน์ส่วนรวมมากกว่าส่วนตน</p>
                      <p><strong>ห่างไกลยาเสพติด เล่นหนึ่งชนิดดนตรีและกีฬา</strong></p>
                      <p>        ๒๐. จัดกิจกรรมการเรียนรู้ให้นักเรียนรักการออกกำลังกาย ดูแลตนเองให้มีสุขภาพและบุคลิกภาพที่ดี มีสุนทรียภาพทางด้านดนตรี และรู้จักหลีกเลี่ยงยาเสพติด</p>
                      <p>       ๒๑. จัดกิจกรรมแข่งขันกีฬาสี /แข่งขันกีฬาเครือข่าย/แข่งขันกีฬาอำเภอ</p>
                      <p>        ๒๒. จัดกิจกรรมตามโครงการโรงเรียนสีขาว<strong>/</strong>โรงเรียน ๓D</p>
                      <p><strong>รู้หนึ่งภาษาต่างชาติ /ฉลาดใช้เทคโนโลยี /มั่งมีสารสนเทศ /รู้บันทึกเหตุการณ์ /เป็นนักอ่านนักคิด</strong></p>
                      <p>        ๒๓. จัดกิจกรรมการเรียนรู้ให้นักเรียนเกิดความคิดสร้างสรรค์ ใฝ่รู้ใฝ่เรียน รักการอ่าน รักการเขียน  รักการศึกษาค้นคว้า รู้ภาษาต่างประเทศ อย่างน้อย  ๑  ภาษา</p>
                      <p>        ๒๔. จัดกิจกรรมการเรียนรู้ให้นักเรียนมีความรู้อันเป็นสากล รู้ทันการเปลี่ยนแปลง และความเจริญก้าวหน้าทางวิชาการ มีทักษะและศักยภาพในการจัดการ การสื่อสาร การใช้เทคโนโลยี และสารสนเทศ รวมถึงรู้จักปรับวิธีการทำงานได้เหมาะสมกับสภาพการณ์</p>
                      <p>       ๒๕. ดำเนินการพัฒนาคุณภาพห้องสมุด สู่ห้องสมุดชุมชน</p>
                      <p><strong>ยึดติดระบอบประชาธิปไตย</strong></p>
                      <p>        ๒๖. จัดกิจกรรมการเรียนรู้ให้นักเรียนเข้าใจประวัติศาสตร์ของชาติไทย ภูมิใจในความเป็นไทย เป็นพลเมืองดี ยึดมั่นในวิถีแบบไทย และยึดมั่นในการปกครองระบอบประชาธิปไตยอันมีพระมหากษัตริย์ทรงเป็นประมุข</p>
                      <p>        ๒๗. จัดกิจกรรมประชาธิปไตยในโรงเรียน</p>
                      <p><strong>ใส่ใจการสหกรณ์</strong></p>
                      <p>        ๒๘. จัดให้มีกิจกรรมสหกรณ์ในโรงเรียน</p>
                      <p><strong>ห่วงอาทรสิ่งแวดล้อม</strong></p>
                      <p>        ๒๙. จัดกิจกรรมการเรียนการสอนเรื่องสิ่งแวดล้อมบูรณาการเข้ากับทุกสาระการเรียนรู้</p>
                      <p><strong>ถึงพร้อมศาสนา</strong></p>
                      <p>        ๓๐. จัดกิจกรรมการเรียนรู้ ให้นักเรียนเข้าใจและปฏิบัติตนตามแนวทางศาสนาที่ตนนับถือ และจัดกิจกรรมประเพณีทางศาสนา</p>
                      <p>       ๓๑. จัดกิจกรรมโรงเรียนคุณธรรมชั้นนำ/โรงเรียนวิถีพุทธ</p>
                      <p><strong>รู้พึ่งพาตนเอง</strong></p>
                      <p>        ๓๒. จัดกิจกรรมการเรียนรู้ การรู้จักพึ่งพาตนเอง บูรณาการเข้ากับทุกสาระการเรียนรู้ /จัดกิจกรรมศึกษาในแหล่งเรียนรู้นอกสถานศึกษา /จัดกิจกรรมทัศนศึกษา</p>
                      <p>        ๓๓. จัดกิจกรรมทักษะชีวิต</p>
                      <p>       ๓๔. ดำเนินการให้เด็กในวัยเรียนในเขตบริการได้รับการศึกษาอย่างน้อยการศึกษาภาคบังคับ</p>
                    </div>