<div class="text-center mt-3">
<strong > <h3> เพลงมาร์ชบางเหรียง 2</h3></strong>

          <p>โอ้บางเหรียง น้ำเงินขาวเราสุขสันต์      ประชาร่วมกันสร้างสรรค์พัฒนา</p>
          <p>หนึ่งร้อยห้าไร่ยายพัวอนุโมทนา เป็นแหล่งศึกษาเพิ่มปัญญาเด็กไทย</p>
          <p>ครูนักเรียนชุมชนร่วมพลัง  ช่างสมดังสถาบันอันยิ่งใหญ่</p>
          <p>เสริมสร้างพื้นฐานประชาธิปไตย  ร่วมจิตร่วมใจประสานมวลชน</p>
          <p>(ซ้ำ) วิชาการเลิศล้ำระบือ  เลื่องลือชื่อกีฬาน่าเกรงขาม</p>
          <p>วินัยเด่นมุ้งเน้นความดีงาม  ช่างสมนามผลปวงปวงประชา</p>
          <p>สามัคคีสร้างคนสร้างชาติ  เพิ่มความสามารถ..กันเถิดหนา</p>
          <p>เราร่วมสร้างพลังสติปัญญา  มาเถิดเรามาพัฒนาบางเหรียงเรา</p>
          <p>มาเถิดเรามาพัฒนาบางเหรียงเรา</p>

          </div>